04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/engine2Valve2D/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 473.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    mappedWalls
    {
        type            coupledTemperature;
        value           $internalField;
    }

    NCMWbase
    {
        type            zeroGradient;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }

    ".*_on_.*"
    {
        type            coupledTemperature;
        value           $internalField;
    }

    "NonConformalError.*"
    {
        type            nonConformalError;
    }

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}


// ************************************************************************* //
