04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/engine2Valve2D/constant/exhaustValve/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/exhaustValve";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        all;

    solidBodyMotionFunction multiValveEngineValveMotion;

    fluidRegion     fluid;

    valve           ev;
}

// ************************************************************************* //
