04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/engine2Valve2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionSolvers
{
    fluid           fluid;
    liner           solid;
    piston          solid;
    cylinderHead    solid;
    exhaustValve    solid;
    intakeValve     solid;
}

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1440;

deltaT          0.05;

writeControl    adjustableRunTime;

writeInterval   5;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           2;

maxDeltaT       1;

userTime
{
    type            engine;
    omega           60 [rpm];
}

// ************************************************************************* //
